package ru.javarush.cryptoanalyzer.konovalov.strategy;

/*
### Взлом (Brute Force)

Вы можете использовать код который написали для расшифровки при известном ключе, подставляя все возможные значения ключа.

Но как понять получилось ли расшифровать? Используйте пример текста (репрезентативный текст автора или в том же стиле);
можете составить словарь слов и составить метрику основанную на том сколько слов совпало и какой они длины;
или иную метрику которая изучает длину слов и предложений, или посмотреть какие буквы чаще всего предшествуют каким буквам
или словарь наиболее частых начал слова (3 буквы), можно вообще не использовать никаких репрезентативных файлов и
проверить правильность пунктуации и пробелов; Вариант с наилучшими результатами сохраните в файл вывода.
 */

public class BruteForceDecoder implements Actionable {
    public void action(String[] args){ //{ encryptedFile.txt, resultFile.txt, example.txt}

    }

}

